In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

#Let's read the first n rows of the file "yt_with_less_col_2020_01.csv" inside the folder interim in data
yt_df = pd.read_csv("data/interim/yt_with_less_col_2020_01.csv")
yt_df.head()

,Unnamed: 0,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,PULocationID,DOLocationID,payment_type,fare_amount,congestion_surcharge
0,0,1577838495,1577838783,1.0,1.2,238,239,1,6.0,2.5
1,1,1577838939,1577839384,1.0,1.2,239,238,1,7.0,2.5
2,2,1577839661,1577840032,1.0,0.6,238,238,1,6.0,2.5
3,3,1577840123,1577840414,1.0,0.8,238,151,1,5.5,0.0
4,4,1577836918,1577837056,1.0,0.0,193,193,2,3.5,0.0

In [3]:
#Let's read the first n rows of the file "nyc_zone_lookup.csv" inside the folder raw in data
districts_df = pd.read_csv("data/raw/nyc_zone_lookup.csv")
districts_df.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [5]:
# Lets merge df
yt_df["PULocationID"] = yt_df["PULocationID"].apply(lambda x: districts_df.loc[x-1]["Borough"]).astype("object")

In [6]:
yt_df["DOLocationID"] = yt_df["DOLocationID"].apply(lambda x: districts_df.loc[x-1]["Borough"]).astype("object")

In [8]:
#Now let's add the changes entered into yt_df into a new csv file called "yt_with_less_col_and_join_with_districts_2020_01.csv"
yt_districts_df = yt_df.to_csv("data/interim/yt_with_less_col_and_join_with_districts_2020_01.csv")

In [60]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

#Let's read the first n rows of the file "yt_with_less_col_and_join_with_districts_2020_01.csv" using the desired columns
yt_districts_df = pd.read_csv("data/interim/yt_with_less_col_and_join_with_districts_2020_01.csv", usecols=["tpep_pickup_datetime", "tpep_dropoff_datetime", "passenger_count", "trip_distance", "PULocationID","DOLocationID","payment_type","fare_amount","congestion_surcharge"])
yt_districts_df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,PULocationID,DOLocationID,payment_type,fare_amount,congestion_surcharge
0,1577838495,1577838783,1.0,1.2,Manhattan,Manhattan,1,6.0,2.5
1,1577838939,1577839384,1.0,1.2,Manhattan,Manhattan,1,7.0,2.5
2,1577839661,1577840032,1.0,0.6,Manhattan,Manhattan,1,6.0,2.5
3,1577840123,1577840414,1.0,0.8,Manhattan,Manhattan,1,5.5,0.0
4,1577836918,1577837056,1.0,0.0,Queens,Queens,2,3.5,0.0

In [61]:
#Now let's remove from from the table the rows with the passenger_count == 0 or NaN (null)
#yt_districts_df.loc[yt_districts_df['passenger_count'].isnull(), 'passenger_count']=0
yt_districts_df.drop(yt_districts_df[(yt_districts_df['passenger_count'] == 0)|(yt_districts_df["passenger_count"].isna())].index,inplace=True)

In [62]:
#Let's check and verify that there are no rows with passenger_count == 0
yt_districts_df.loc[yt_districts_df['passenger_count'] == 0]

Empty DataFrame
Columns: [tpep_pickup_datetime, tpep_dropoff_datetime, passenger_count, trip_distance, PULocationID, DOLocationID, payment_type, fare_amount, congestion_surcharge]
Index: []

In [63]:
#Let's check and verify that there are no rows with passenger_count NaN
yt_districts_df.loc[yt_districts_df['passenger_count'].isna()]

Empty DataFrame
Columns: [tpep_pickup_datetime, tpep_dropoff_datetime, passenger_count, trip_distance, PULocationID, DOLocationID, payment_type, fare_amount, congestion_surcharge]
Index: []

In [64]:
#Let's see the table
yt_districts_df

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,PULocationID,DOLocationID,payment_type,fare_amount,congestion_surcharge
0,1577838495,1577838783,1.0,1.20,Manhattan,Manhattan,1,6.0,2.5
1,1577838939,1577839384,1.0,1.20,Manhattan,Manhattan,1,7.0,2.5
2,1577839661,1577840032,1.0,0.60,Manhattan,Manhattan,1,6.0,2.5
3,1577840123,1577840414,1.0,0.80,Manhattan,Manhattan,1,5.5,0.0
4,1577836918,1577837056,1.0,0.00,Queens,Queens,2,3.5,0.0
...,...,...,...,...,...,...,...,...,...
6339562,1580513887,1580514741,1.0,2.10,Manhattan,Manhattan,1,11.0,2.5
6339563,1580511618,1580512758,1.0,2.13,Manhattan,Manhattan,1,13.0,2.5
6339564,1580513062,1580514039,1.0,2.55,Manhattan,Manhattan,1,12.5,2.5
6339565,1580514262,1580514840,1.0,1.61,Manhattan,Manhattan,2,8.5,2.5
6339566,1580512777,1580512841,1.0,0.00,Queens,Queens,1,0.0,0.0

In [69]:
#Let's look at the table by setting the condition that PULocationID is different from DOLocationID and the trip_distance == 0
yt_districts_df.loc[(yt_districts_df['PULocationID'] != yt_districts_df['DOLocationID']) & (yt_districts_df['trip_distance'] == 0)]

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,PULocationID,DOLocationID,payment_type,fare_amount,congestion_surcharge
2032,1577839604,1577839604,4.0,0.0,Manhattan,Unknown,2,0.0,0.0
2055,1577839082,1577839082,1.0,0.0,Manhattan,Unknown,2,7.0,2.5
2056,1577839600,1577839600,1.0,0.0,Manhattan,Unknown,2,7.0,2.5
2365,1577838614,1577841044,1.0,0.0,Manhattan,Queens,1,42.2,0.0
2720,1577838882,1577839653,1.0,0.0,Unknown,Bronx,1,22.2,0.0
...,...,...,...,...,...,...,...,...,...
6338612,1580515106,1580515108,1.0,0.0,Manhattan,Unknown,1,12.0,0.0
6338666,1580514846,1580517320,1.0,0.0,Queens,Brooklyn,1,32.2,0.0
6338932,1580511915,1580514703,4.0,0.0,Manhattan,Brooklyn,2,44.0,2.5
6338992,1580514159,1580514162,1.0,0.0,Bronx,Unknown,1,16.0,0.0
6339401,1580512668,1580512671,5.0,0.0,Manhattan,Unknown,1,65.0,0.0

In [148]:
#Let's see districts with unique PULocation values
districs = yt_districts_df["PULocationID"].unique()
#Let's create a dictionary with the values ​​of PULocation, DOLocation and Average trip
dict_avg_trip = {
    "PUL" : [],
    "DOL" : [],
    "AVG_TRIP": []
}

#Create a table with the information of PULocationID, DOLocationID and Average trip
for i in range(len(districs)):
    for j in range(len(districs)):
        PUL=districs[i]
        DOL=districs[j]
        avg_trip = yt_districts_df.query("PULocationID == @PUL and DOLocationID == @DOL")["trip_distance"].mean()
        dict_avg_trip["PUL"].append(PUL)
        dict_avg_trip["DOL"].append(DOL)
        dict_avg_trip["AVG_TRIP"].append(avg_trip)

avg_trip_df = pd.DataFrame(dict_avg_trip)

In [139]:
#Calculate the average trip_distance between the values ​​that have PULocationID == Manhattan and DOLocationID == Queens
yt_districts_df.query("PULocationID == 'Manhattan' and DOLocationID == 'Queens'")["trip_distance"].mean()

10.273203884058644

In [140]:
#Calculate the average trip_distance between the values ​​that have PULocationID == Queens and DOLocationID == Manhattan
yt_districts_df.query("PULocationID == 'Queens' and DOLocationID == 'Manhattan'")["trip_distance"].mean()

13.40305313472092

In [202]:
#null_trip is equal to values ​​with PULocation other than DOLocation and trip_distance == 0
null_trip = yt_districts_df.loc[(yt_districts_df['PULocationID'] != yt_districts_df['DOLocationID']) & (yt_districts_df['trip_distance'] == 0)]
null_trip.reset_index()

,index,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,PULocationID,DOLocationID,payment_type,fare_amount,congestion_surcharge
0,2032,1577839604,1577839604,4.0,0.0,Manhattan,Unknown,2,0.0,0.0
1,2055,1577839082,1577839082,1.0,0.0,Manhattan,Unknown,2,7.0,2.5
2,2056,1577839600,1577839600,1.0,0.0,Manhattan,Unknown,2,7.0,2.5
3,2365,1577838614,1577841044,1.0,0.0,Manhattan,Queens,1,42.2,0.0
4,2720,1577838882,1577839653,1.0,0.0,Unknown,Bronx,1,22.2,0.0
...,...,...,...,...,...,...,...,...,...,...
16718,6338612,1580515106,1580515108,1.0,0.0,Manhattan,Unknown,1,12.0,0.0
16719,6338666,1580514846,1580517320,1.0,0.0,Queens,Brooklyn,1,32.2,0.0
16720,6338932,1580511915,1580514703,4.0,0.0,Manhattan,Brooklyn,2,44.0,2.5
16721,6338992,1580514159,1580514162,1.0,0.0,Bronx,Unknown,1,16.0,0.0
16722,6339401,1580512668,1580512671,5.0,0.0,Manhattan,Unknown,1,65.0,0.0

In [203]:
#Let's take the null_trips considered above and replace the values ​​that have trip_distance == 0 or NaN with the AVG_TRIP of the route
for i in range(len(null_trip.index)):
    PULL=null_trip.iloc[i]["PULocationID"]
    DOL=null_trip.iloc[i]["DOLocationID"]
    INDEX=null_trip.index[i]
    AVG=avg_trip_df.loc[(avg_trip_df["PUL"]==PULL)&(avg_trip_df["DOL"]==DOL)]["AVG_TRIP"]
    yt_districts_df.at[INDEX,"trip_distance"] = AVG

In [204]:
yt_districts_df.loc[(yt_districts_df['PULocationID'] != yt_districts_df['DOLocationID']) & (yt_districts_df['trip_distance'] == 0)]

Empty DataFrame
Columns: [tpep_pickup_datetime, tpep_dropoff_datetime, passenger_count, trip_distance, PULocationID, DOLocationID, payment_type, fare_amount, congestion_surcharge]
Index: []

In [206]:
yt_districts_df.loc[(yt_districts_df['trip_distance'] == 0)]

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,PULocationID,DOLocationID,payment_type,fare_amount,congestion_surcharge
4,1577836918,1577837056,1.0,0.0,Queens,Queens,2,3.50,0.0
6,1577839165,1577839169,1.0,0.0,Queens,Queens,1,2.50,0.0
7,1576682869,1576682939,1.0,0.0,Queens,Queens,1,0.01,2.5
8,1576683035,1576683095,4.0,0.0,Queens,Queens,1,2.50,2.5
19,1577838339,1577838425,1.0,0.0,Manhattan,Manhattan,4,3.00,2.5
...,...,...,...,...,...,...,...,...,...
6339436,1580514665,1580514668,1.0,0.0,Queens,Queens,3,2.50,0.0
6339482,1580515207,1580515214,1.0,0.0,Unknown,Unknown,1,228.00,0.0
6339489,1580514957,1580515443,1.0,0.0,Manhattan,Manhattan,2,6.50,2.5
6339508,1580512494,1580512557,1.0,0.0,Queens,Queens,3,2.50,0.0
6339566,1580512777,1580512841,1.0,0.0,Queens,Queens,1,0.00,0.0